CSI API ETABS v1

# eMatTypeColdFormed Enumeration

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eMatTypeColdFormed

    Public Enumeration eMatTypeColdFormed

    Dim instance As eMatTypeColdFormed

    public enum class eMatTypeColdFormed

    type eMatTypeColdFormed

Members

| Member name| Value| Description
---|---|---|---
| ASTM_A653SQGr33| 1|
| ASTM_A653SQGr50| 2|

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com